// Copyright (c) 2011 The Chromium OS Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

/* Menus */
"Menu About" = "Teave Chrome OS Image Creatori kohta";
"Menu Prefs" = "Eelistused …";
"Menu Services" = "Teenused";
"Menu Hide" = "Peida Chrome OS Image Creator";
"Menu Hide Others" = "Peida teised";
"Menu Show All" = "Kuva kõik";
"Menu Quit" = "Sule Chrome OS Image Creator";
"Menu Window" = "Aken";
"Menu Minimize" = "Minimeeri";
"Menu Zoom" = "Suumi";
"Menu Bring All To Front" = "Too kõik ette";
"Menu Help" = "Abi";
"Menu App Help" = "Chrome OS Image Creatori abi";

/* Buttons */
"Button Previous" = "Eelmine";
"Button Next" = "Järgmine";
"Button Stop" = "Peata";
"Button Done" = "Valmis";

/* Tab: Select device model */
"Text Welcome" = "Tere tulemast Chrome OS Image Creatorisse! Valige Chrome OS-i seadme mudel,  mida kasutate.";
"Button Local Image" = "Kohalik kujutis …";

/* Tab: Select USB stick */
"Text Select Prompt" = "Valige taastamiseks kasutatav USB-mälupulk:";
"Text Insertion Prompt" = "Sisestage USB-mälupulk.";

/* Tab: Done */
"Text Congrats" = "Olete loonud Chrome OS-i seadme jaoks taastebuutketta. Eemaldage see arvutist ja kasutage seda Chromebook kahjustatud operatsioonisüsteemi taastamiseks.";

/* Sizes */
"Size Bytes" = " bytes";
"Size Kilobytes" = " KB";
"Size Megabytes" = " MB";
"Size Gigabytes" = " GB";
"Size Terabytes" = " TB";
"Size Petabytes" = " PB";

/* Error starting Disk Arbitration. */
"NoDiskArb Message" = "Seda rakendust ei saa käitada.";
"NoDiskArb Informative" = "Disk Arbitrationi käivitamisel ilmnes probleem. Seda poleks tohtinud juhtuda.";
"NoDiskArb OK" = "OK";

/* Error retrieving config file. */
"CantGetConfig Message" = "Kujutiste loendit ei saa tuua.";
"CantGetConfig Informative" = "Saadaolevate taastekujutiste loendi toomisel ilmnes probleem (%1$@). Kontrollige, kas võrguühendus töötab.";
"CantGetConfig OK" = "OK";
"CantGetConfig Error NoConnection" = "Ühendust ei õnnestunud määrata";
"CantGetConfig Error DownloadError" = "Allalaadimise ajal ilmnes viga";
"CantGetConfig Error StringCreate" = "Vastust ei saanud kasutada";

/* Version error. */
"VersionError Message" = "See rakenduse versioon on liiga vana.";
"VersionError Informative" = "Laadige alla uuem versioon. See on versioon %1$@, nõutav on vähemalt versioon %2$@. %3$@";
"VersionError OK" = "Hankige uus versioon";

/* File dialog to select a local file. */
"SelectLocal File" = "Valige kujutis:";
"SelectLocal Button" = "Valimine";

/* Alert on writing stick. */
"WriteAlert Message" = "Kas soovite kindlasti jäädavalt kustutada andmed mälupulgalt %1$@?";
"WriteAlert Informative" = "Kõik selles olevad andmed kustutatakse jäädavalt. Seda toimingut ei saa tagasi võtta.";
"WriteAlert Cancel" = "Ära kustuta";
"WriteAlert OK" = "Kustuta";

"TooSmallAlert Message" = "Mälupulka %1$@ ei saa kasutada, selle maht on liiga väike.";
"TooSmallAlert Informative" = "Nõutav on mälupulk mahuga vähemalt %2$@.";
"TooSmallAlert OK" = "OK";

"NotWritable Message" = "Mälupulka %1$@ ei saa kasutada, see on kirjutuskaitstud.";
"NotWritable Informative" = "Mälupulk on kirjutuskaitstud. Pulgal võib olla lüliti, mis võimaldab sellele kirjutada. Muul juhul ei saa seda kasutada.";
"NotWritable OK" = "OK";

/* Stick writing statuses. */
"Status Downloading" = "Allalaadimine …";
"Status Verifying" = "Kinnitamine …";
"Status Unpacking" = "Lahtipakkimine …";
"Status Claiming" = "Taotlemine …";
"Status Unmounting" = "Eraldamine …";
"Status Writing" = "Kirjutamine …";
"Status Ejecting" = "Väljutamine …";
"Status Done" = "Valmis.";

"StatusAdd Attempt" = " (katse %1$d)";

/* Errors */
"Failure Downloading" = "Vabandust, ilmnes viga (allikakujutise allalaadimine nurjus). Kas soovite uuesti proovida?";
"Failure Verifying Return Value" = "Vabandust, ilmnes viga (allikakujutise kinnitamine nurjus, programmi tõrge, %1$s). Kas soovite uuesti proovida?";
"Failure Verifying SHA Mismatch" = "Vabandust, ilmnes viga (allikakujutise kinnitamine nurjus, kontrollsumma tõrge). Kas soovite uuesti proovida?";
"Failure Unpacking" = "Vabandust, ilmnes viga (allikakujutise %1$s lahtipakkimine nurjus). Kas soovite uuesti proovida?";
"Failure Claiming" = "Vabandust, ilmnes viga (USB-mälupulga taotlemine nurjus). Kas soovite uuesti proovida?";
"Failure Unmounting" = "Vabandust, ilmnes viga (USB-mälupulga eemaldamine nurjus). Kas soovite uuesti proovida?";
"Failure Opening Source Image" = "Vabandust, ilmnes viga (allikakujutise avamine nurjus, %1$s). Kas soovite uuesti proovida?";
"Failure Opening Destination Device" = "Vabandust, ilmnes viga (USB-mälupulga avamine nurjus, %1$s). Kas soovite uuesti proovida?";
"Failure Reading Source Image" = "Vabandust, ilmnes viga (allikakujutise lugemine nurjus, %1$s). Kas soovite uuesti proovida?";
"Failure Writing Destination Device" = "Vabandust, ilmnes viga (andmete kirjutamine USB-mälupulgale nurjus, %1$s). Kas soovite uuesti proovida?";
"Failure Ejecting" = "Vabandust, ilmnes viga (USB-mälupulga väljutamine nurjus). Kas soovite uuesti proovida?";

"Failure Try Again" = "Proovi uuesti";
"Failure Quit" = "Katkesta";

"Failure Termination Status" = "Lõpetamise olek %d";

"Failure Internal Error 1" = "Ootamatu EOF";
